Conf.Simple/src/InformationRegisters/SUI_ЛогированиеHTTPЗапросов/SUI_ЛогированиеHTTPЗапросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ЛогированиеHTTPЗапросов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КодСостояния</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БазовыйURL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтносительныйURL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторУстройства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияПриложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДанныеЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДанныеОтвета</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ОтветЕстьДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтветЖдать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтветКоманда</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтветНетДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МеткаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>SID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Метод</name>
    <type>
      <types>EnumRef.SUI_HTTPМетоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_ЛогированиеHTTPЗапросов/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГиперссылкаURL.Заголовок = Запись.БазовыйURL + Запись.ОтносительныйURL;
	МобильноеУстройство = ПланыОбмена.SUI_МобильныеУстройства.НайтиПоКоду(Запись.ИдентификаторУстройства);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Отказ Или ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Окно.Содержимое.Количество() > 1 Тогда
		Окно.Содержимое[Окно.Содержимое.ВГраница()].Закрыть();
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГиперссылкаURLНажатие(Элемент)
	ЗапуститьПриложение(Элемент.Заголовок);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьДанные(Команда)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Заголовок",
		СтрШаблон("%1 %2 %3 (%4)", Запись.КодСостояния, Запись.Метод, Запись.ОтносительныйURL, Запись.Период));
	ПараметрыОткрытия.Вставить("РежимПросмотраПриОткрытии", Истина);
	ПараметрыОткрытия.Вставить("СтрокиJSON", Новый СписокЗначений());
	
	ПараметрыОткрытия.СтрокиJSON.Добавить(Запись.ДанныеЗапроса, НСтр("ru = 'Запрос'"));
	ПараметрыОткрытия.СтрокиJSON.Добавить(Запись.ДанныеОтвета, НСтр("ru = 'Ответ'"));
	
	#Если ВебКлиент Тогда
		ОткрытьФорму("Обработка.SUI_РедакторJSON.Форма", ПараметрыОткрытия, ЭтотОбъект, УникальныйИдентификатор, , , , 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	#Иначе
		ОткрытьФорму("Обработка.SUI_РедакторJSON.Форма", ПараметрыОткрытия, ЭтотОбъект, УникальныйИдентификатор, Окно);
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти
